7767517
35 40
Convolution      conv1            1 1 data conv1 0=96 1=7 2=1 3=2 4=3 5=1 6=14112
ReLU             relu1            1 1 conv1 conv1_relu1
LRN              norm1            1 1 conv1_relu1 norm1 0=1 1=3 2=0.000050 3=0.750000
Pooling          pool1            1 1 norm1 pool1 0=0 1=3 2=2 3=1 4=0
Convolution      conv2            1 1 pool1 conv2 0=256 1=5 2=1 3=2 4=2 5=1 6=614400
ReLU             relu2            1 1 conv2 conv2_relu2
LRN              norm2            1 1 conv2_relu2 norm2 0=1 1=3 2=0.000050 3=0.750000
Pooling          pool2            1 1 norm2 pool2 0=0 1=3 2=2 3=1 4=0
Convolution      conv3            1 1 pool2 conv3 0=384 1=3 2=1 3=1 4=1 5=1 6=884736
ReLU             relu3            1 1 conv3 conv3_relu3
Convolution      conv4            1 1 conv3_relu3 conv4 0=384 1=3 2=1 3=1 4=1 5=1 6=1327104
ReLU             relu4            1 1 conv4 conv4_relu4
Convolution      conv5            1 1 conv4_relu4 conv5 0=256 1=3 2=1 3=1 4=1 5=1 6=884736
ReLU             relu5            1 1 conv5 conv5_relu5
Split            splitncnn_0      1 2 conv5_relu5 conv5_relu5_splitncnn_0 conv5_relu5_splitncnn_1
Convolution      rpn_conv1        1 1 conv5_relu5_splitncnn_1 rpn_conv1 0=256 1=3 2=1 3=1 4=1 5=1 6=589824
ReLU             rpn_relu1        1 1 rpn_conv1 rpn_conv1_rpn_relu1
Split            splitncnn_1      1 2 rpn_conv1_rpn_relu1 rpn_conv1_rpn_relu1_splitncnn_0 rpn_conv1_rpn_relu1_splitncnn_1
Convolution      rpn_cls_score    1 1 rpn_conv1_rpn_relu1_splitncnn_1 rpn_cls_score 0=18 1=1 2=1 3=1 4=0 5=1 6=4608
Convolution      rpn_bbox_pred    1 1 rpn_conv1_rpn_relu1_splitncnn_0 rpn_bbox_pred 0=36 1=1 2=1 3=1 4=0 5=1 6=9216
Reshape          rpn_cls_score_reshape 1 1 rpn_cls_score rpn_cls_score_reshape 0=0 1=0 2=-1 3=0
Softmax          rpn_cls_prob     1 1 rpn_cls_score_reshape rpn_cls_prob 0=0 1=1
Reshape          rpn_cls_prob_reshape 1 1 rpn_cls_prob rpn_cls_prob_reshape 0=0 1=0 2=-1 3=0
Proposal         proposal         3 1 rpn_cls_prob_reshape rpn_bbox_pred im_info rois 0=16 1=16 2=6000 3=300 4=0.700000 5=16
ROIPooling       roi_pool_conv5   2 1 conv5_relu5_splitncnn_0 rois roi_pool_conv5 0=6 1=6 2=0.062500
InnerProduct     fc6              1 1 roi_pool_conv5 fc6 0=4096 1=1 2=37748736
ReLU             relu6            1 1 fc6 fc6_relu6
Dropout          drop6            1 1 fc6_relu6 fc6_drop6 0=0.500000
InnerProduct     fc7              1 1 fc6_drop6 fc7 0=4096 1=1 2=16777216
ReLU             relu7            1 1 fc7 fc7_relu7
Dropout          drop7            1 1 fc7_relu7 fc7_drop7 0=0.500000
Split            splitncnn_2      1 2 fc7_drop7 fc7_drop7_splitncnn_0 fc7_drop7_splitncnn_1
InnerProduct     cls_score        1 1 fc7_drop7_splitncnn_1 cls_score 0=21 1=1 2=86016
InnerProduct     bbox_pred        1 1 fc7_drop7_splitncnn_0 bbox_pred 0=84 1=1 2=344064
Softmax          cls_prob         1 1 cls_score cls_prob 0=0 1=1
